In [1]:
import pandas as pd

In [3]:
items = [
    {'bikes': 20, 'pants': 30, 'watches': 35},
    {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5}
]
stored_items = pd.DataFrame(items, index=['store 1', 'store 2'])
stored_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [4]:
stored_items[['bikes']]

         bikes
store 1     20
store 2     15

In [5]:
stored_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [6]:
stored_items.loc[['store 1']]

         bikes  glasses  pants  watches
store 1     20      NaN     30       35

In [7]:
stored_items['bikes']['store 2']

15

In [8]:
stored_items['shirts'] = [15, 2]
stored_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [9]:
stored_items['suits'] = stored_items['shirts'] + stored_items['pants']
stored_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [10]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses':4}]

new_store = pd.DataFrame(new_items, index=['store 3'])
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [11]:
stored_items = stored_items.append(new_store)
stored_items

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [12]:
stored_items['new_watches'] = stored_items['watches'][1:]
stored_items

         bikes  glasses  pants  shirts  suits  watches  new_watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [13]:
stored_items.insert(5, 'shoes',[8, 5, 0])
stored_items

         bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store 1     20      NaN     30    15.0   45.0      8       35          NaN
store 2     15     50.0      5     2.0    7.0      5       10         10.0
store 3     20      4.0     30     NaN    NaN      0       35         35.0

In [14]:
stored_items.pop('new_watches')
stored_items

         bikes  glasses  pants  shirts  suits  shoes  watches
store 1     20      NaN     30    15.0   45.0      8       35
store 2     15     50.0      5     2.0    7.0      5       10
store 3     20      4.0     30     NaN    NaN      0       35

In [16]:
stored_items = stored_items.drop(['shoes','watches'], axis=1)
stored_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [17]:
stored_items = stored_items.drop(['store 1','store 2'], axis=0)
stored_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

In [18]:
stored_items = stored_items.rename(columns={'bikes':'hats'})
stored_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

In [19]:
stored_items = stored_items.rename(index={'store 3':'last store'})
stored_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [20]:
stored_items = stored_items.set_index('pants')
stored_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN